---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo
source: html/2d0e55f6-fbb5-a5c6-2423-6bb4e759d56e.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo

An enumerated type that represents the type of structural locations to which a connection annotation may be applied.

## Syntax (C#)
```csharp
public enum StructuralConnectionApplyTo
```